Gerflor/FindOrgPayload.txt

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://xmlns.oracle.com/apps/cdm/foundation/parties/organizationService/applicationModule/types/" xmlns:typ1="http://xmlns.oracle.com/adf/svc/types/">
   <soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
      <wsse:Security soap:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
         <wsu:Timestamp wsu:Id="TS-419934E8875F076DCA16641936076275">
            <wsu:Created>2022-09-26T12:00:07.626Z</wsu:Created>
            <wsu:Expires>2022-09-26T12:01:07.626Z</wsu:Expires>
         </wsu:Timestamp>
         <wsu:Timestamp wsu:Id="TS-419934E8875F076DCA16641776207284">
            <wsu:Created>2022-09-26T07:33:40.728Z</wsu:Created>
            <wsu:Expires>2022-09-26T07:34:40.728Z</wsu:Expires>
         </wsu:Timestamp>
         <wsse:UsernameToken>
            <wsse:Username>Yehya@mact.com.sa</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">Welcome@12345</wsse:Password>
         </wsse:UsernameToken>
      </wsse:Security>
   </soap:Header>
   <soap:Body>
      <typ:findOrganization>
         <typ:findCriteria>
            <typ1:fetchStart>0</typ1:fetchStart>
            <typ1:fetchSize>-1</typ1:fetchSize>
            <typ1:filter>
               <typ1:conjunction/>
               <typ1:group>
                  <typ1:conjunction/>
                  <typ1:item>
                     <typ1:conjunction/>
                     <typ1:upperCaseCompare>false</typ1:upperCaseCompare>
                     <typ1:attribute>PartyName</typ1:attribute>
                     <typ1:operator>=</typ1:operator>
                     <typ1:value>{{_transaction_customer_t_company_name}}</typ1:value>
                  </typ1:item>
               </typ1:group>
               <typ1:nested/>
            </typ1:filter>
            <typ1:excludeAttribute>false</typ1:excludeAttribute>
            <typ1:childFindCriteria>
               <typ1:fetchStart>0</typ1:fetchStart>
               <typ1:fetchSize>-1</typ1:fetchSize>
               <typ1:filter>
                  <typ1:group>
                     <typ1:upperCaseCompare>false</typ1:upperCaseCompare>
                     <typ1:item>
                        <typ1:upperCaseCompare>false</typ1:upperCaseCompare>
                        <typ1:attribute>Status</typ1:attribute>
                        <typ1:operator>=</typ1:operator>
                        <typ1:value>A</typ1:value>
                     </typ1:item>
                  </typ1:group>
               </typ1:filter>
               <typ1:childFindCriteria/>
               <typ1:childAttrName>PartySite</typ1:childAttrName>
               <typ1:childFindCriteria>
                  <typ1:fetchStart>0</typ1:fetchStart>
                  <typ1:fetchSize>-1</typ1:fetchSize>
                  <typ1:filter>
                     <typ1:group>
                        <typ1:upperCaseCompare>false</typ1:upperCaseCompare>
                        <typ1:item>
                           <typ1:upperCaseCompare>false</typ1:upperCaseCompare>
                           <typ1:attribute>Status</typ1:attribute>
                           <typ1:operator>=</typ1:operator>
                           <typ1:value>A</typ1:value>
                        </typ1:item>
                     </typ1:group>
                  </typ1:filter>
                  <typ1:childFindCriteria/>
                  <typ1:childAttrName>CustomerAccountSiteUse</typ1:childAttrName>
               </typ1:childFindCriteria>
            </typ1:childFindCriteria>
         </typ:findCriteria>
         <typ:findControl>
            <typ1:retrieveAllTranslations>false</typ1:retrieveAllTranslations>
         </typ:findControl>
      </typ:findOrganization>
   </soap:Body>
</soap:Envelope>